In [1]:
import numpy as np
import pandas as pd

In [15]:
dereceler = [[30,20,40],[29,np.nan,38],[np.nan,25,38]]

In [16]:
dereceler

[[30, 20, 40], [29, nan, 38], [nan, 25, 38]]

In [17]:
günler = ["pazartesi","salı","çarşamba"]

In [18]:
günler = pd.Index(günler)

In [19]:
günler

Index(['pazartesi', 'salı', 'çarşamba'], dtype='object')

In [20]:
havaDurumu = pd.DataFrame(dereceler,index=günler,columns=["istanbul","ankara","izmir"])

In [21]:
havaDurumu

           istanbul  ankara  izmir
pazartesi      30.0    20.0     40
salı           29.0     NaN     38
çarşamba        NaN    25.0     38

In [22]:
havaDurumu.dropna()

           istanbul  ankara  izmir
pazartesi      30.0    20.0     40

In [23]:
havaDurumu

           istanbul  ankara  izmir
pazartesi      30.0    20.0     40
salı           29.0     NaN     38
çarşamba        NaN    25.0     38

In [24]:
yeniVeri = {"Mersin" : [33,32,np.nan],"Adana":[34,np.nan,36],"İzmir" : [21,22,23],"Antalya":[40,np.nan,np.nan]}

In [25]:
yeniDataFrame = pd.DataFrame(yeniVeri)

In [26]:
yeniDataFrame

   Mersin  Adana  İzmir  Antalya
0    33.0   34.0     21     40.0
1    32.0    NaN     22      NaN
2     NaN   36.0     23      NaN

In [27]:
yeniDataFrame.dropna()

   Mersin  Adana  İzmir  Antalya
0    33.0   34.0     21     40.0

In [28]:
yeniDataFrame.dropna(axis=1)

   İzmir
0     21
1     22
2     23

In [31]:
yeniDataFrame.dropna(axis=1 , thresh=2)
# thresh sınırı belirtik kaça kadar kabul edilmesi 2 ve üzerini atar.

   Mersin  Adana  İzmir
0    33.0   34.0     21
1    32.0    NaN     22
2     NaN   36.0     23

In [32]:
yeniDataFrame.fillna("Boş")

  Mersin Adana  İzmir Antalya
0   33.0  34.0     21    40.0
1   32.0   Boş     22     Boş
2    Boş  36.0     23     Boş

In [33]:
yeniDataFrame

   Mersin  Adana  İzmir  Antalya
0    33.0   34.0     21     40.0
1    32.0    NaN     22      NaN
2     NaN   36.0     23      NaN

## groupby

In [45]:
maasSozlugu = {"Departman":["Yazılım","Satış","Yazılım","Finanas","İnsan Kaynakları","Finanas"],
              "Calisan Ismi" : ["Ahmet","Mehmet","Tolga","Furkan","Kılınç","Arda"],
              "Maas": [100,200,300,400,500,600]}

In [46]:
maasDataFrame = pd.DataFrame(maasSozlugu)

In [47]:
maasDataFrame

          Departman Calisan Ismi  Maas
0           Yazılım        Ahmet   100
1             Satış       Mehmet   200
2           Yazılım        Tolga   300
3           Finanas       Furkan   400
4  İnsan Kaynakları       Kılınç   500
5           Finanas         Arda   600

In [48]:
grupObjesi = maasDataFrame.groupby("Departman")

In [49]:
grupObjesi.count()

                  Calisan Ismi  Maas
Departman
Finanas                      2     2
Satış                        1     1
Yazılım                      2     2
İnsan Kaynakları             1     1

In [50]:
grupObjesi.mean()

                   Maas
Departman
Finanas           500.0
Satış             200.0
Yazılım           200.0
İnsan Kaynakları  500.0

In [51]:
grupObjesi.max()

                 Calisan Ismi  Maas
Departman
Finanas                Furkan   600
Satış                  Mehmet   200
Yazılım                 Tolga   300
İnsan Kaynakları       Kılınç   500

In [52]:
grupObjesi.min()

                 Calisan Ismi  Maas
Departman
Finanas                  Arda   400
Satış                  Mehmet   200
Yazılım                 Ahmet   100
İnsan Kaynakları       Kılınç   500

In [54]:
grupObjesi.describe()
# tanıtmak

                  Maas
                 count   mean         std    min    25%    50%    75%    max
Departman
Finanas            2.0  500.0  141.421356  400.0  450.0  500.0  550.0  600.0
Satış              1.0  200.0         NaN  200.0  200.0  200.0  200.0  200.0
Yazılım            2.0  200.0  141.421356  100.0  150.0  200.0  250.0  300.0
İnsan Kaynakları   1.0  500.0         NaN  500.0  500.0  500.0  500.0  500.0

## CONCAT

In [55]:
datas = {"Isim": ["Tolga","Furkan","Arda","Kılınç"],
        "Spor" : ["Koşu","Yüzme","Koşu","Basketbol"],
        "Kalori" : [100,200,300,400]
        }

In [58]:
dataFrame1 = pd.DataFrame(datas,index=[0,1,2,3])

In [59]:
dataFrame1

     Isim       Spor  Kalori
0   Tolga       Koşu     100
1  Furkan      Yüzme     200
2    Arda       Koşu     300
3  Kılınç  Basketbol     400

In [60]:
datas2 = {"Isim":["Ali","Orhan","Murat","Emirhan"],
         "Spor" :["Teakwondo","Judo","Karate","Taekwondo"],
         "Kalori": [150,200,300,150]}

In [61]:
datas2

{'Isim': ['Ali', 'Orhan', 'Murat', 'Emirhan'],
 'Spor': ['Teakwondo', 'Judo', 'Karate', 'Taekwondo'],
 'Kalori': [150, 200, 300, 150]}

In [62]:
dataFrame2 = pd.DataFrame(datas2,index=[4,5,6,7])

In [63]:
dataFrame2

      Isim       Spor  Kalori
4      Ali  Teakwondo     150
5    Orhan       Judo     200
6    Murat     Karate     300
7  Emirhan  Taekwondo     150

In [64]:
datas3 = {"Isim": ["Aleyna","Bahar","Cemre","Nazlı"],
         "Spor" : ["Koşu","Basketbol","Dans","Taekwondo"],
         "Kalori": [50,100,105,200],
         }

In [65]:
datas3

{'Isim': ['Aleyna', 'Bahar', 'Cemre', 'Nazlı'],
 'Spor': ['Koşu', 'Basketbol', 'Dans', 'Taekwondo'],
 'Kalori': [50, 100, 105, 200]}

In [66]:
dataFrame3 = pd.DataFrame(datas3,index=[8,9,10,11])

In [67]:
dataFrame3

      Isim       Spor  Kalori
8   Aleyna       Koşu      50
9    Bahar  Basketbol     100
10   Cemre       Dans     105
11   Nazlı  Taekwondo     200

In [74]:
toplamDataFrame = pd.concat([dataFrame1,dataFrame2,dataFrame3],axis=0)

In [75]:
toplamDataFrame

       Isim       Spor  Kalori
0     Tolga       Koşu     100
1    Furkan      Yüzme     200
2      Arda       Koşu     300
3    Kılınç  Basketbol     400
4       Ali  Teakwondo     150
5     Orhan       Judo     200
6     Murat     Karate     300
7   Emirhan  Taekwondo     150
8    Aleyna       Koşu      50
9     Bahar  Basketbol     100
10    Cemre       Dans     105
11    Nazlı  Taekwondo     200

## merge

In [76]:
meyve = {"Meyve" : ["Elma","Armut","Muz"],
        "Renk" : ["Kırmızı","Yeşi","Sarı"]}

In [77]:
meyveFrame = pd.DataFrame(meyve)

In [78]:
meyveFrame

   Meyve     Renk
0   Elma  Kırmızı
1  Armut     Yeşi
2    Muz     Sarı

In [79]:
meyve2 = {"Meyve" : ["Elma","Armut","Muz"],
        "Kalori" : [100,200,300]}

In [81]:
meyve2Frame = pd.DataFrame(meyve2)

In [82]:
meyve2Frame

   Meyve  Kalori
0   Elma     100
1  Armut     200
2    Muz     300

In [88]:
mergeMeyve = pd.merge(meyveFrame,meyve2Frame, on="Meyve")

In [89]:
mergeMeyve

   Meyve     Renk  Kalori
0   Elma  Kırmızı     100
1  Armut     Yeşi     200
2    Muz     Sarı     300